Revit 2024 API
Transform2D.GetInverse Method
 Gets the inverse transformation of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Transform2D GetInverse()
Visual Basic
Public Function GetInverse As Transform2D
Visual C++
public:
Transform2D^ GetInverse()
Remarks
 The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This transformation is not conformal or invertible.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace